package enums;

public enum Category {

    любаяКатегория("Любая категория"),
    автомобили("Автомобили"),
    мотоциклыИМототехника("Мотоциклы и мототехника"),
    грузовикиИСпецтехника("Грузовики и спецтехника"),
    водныйТранспорт("Водный транспорт"),
    запчастиИАксессуары("Запчасти и аксессуары"),
    квартиры("Квартиры"),
    комнаты("Комнаты"),
    домаДачиКоттеджи("Дома, дачи, коттеджи"),
    гаражиИМашиноместа("Гаражи и машиноместа"),
    земельныеУчастки("Земельные участки"),
    коммерческаяНедвижимость("Коммерческая недвижимость"),
    недвижимостьЗаРубежом("Недвижимость за рубежом"),
    вакансии("Вакансии"),
    резюме("Резюме"),
    одеждаОбувьАксессуары("Одежда, обувь, аксессуары"),
    детскаОдеждаИОбувь("Детская одежда и обувь"),
    товарДляДетейИИгрушки("Товары для детей и игрушки"),
    часыИУкрашения("Часы и украшения"),
    красотаИЗдоровье("Красота и здоровье"),
    бытоваяТехника("Бытовая техника"),
    мебельИИнтерьер("Мебель и интерьер"),
    посудаИТоварыДляКухни("Посуда и товары для кухни"),
    продуктыПитания("Продукты питания"),
    ремонтИСтроительство("Ремонт и строительство"),
    растения("Растения"),
    аудиоИВидео("Аудио и видео"),
    игрыПриставкиИПрограммы("Игры, приставки и программы"),
    настольныеКомпьютеры("Настольные компьютеры"),
    ноутбуки("Ноутбуки"),
    оргтехникаИРасходники("Оргтехника и расходники"),
    планшетыИЭлектронныеКниги("Планшеты и электронные книги"),
    телефоны("Телефоны"),
    товарыДляКомпьютера("Товары для компьютера"),
    фототехника("Фототехника"),
    билетыИПутешествия("Билеты и путешествия"),
    велосипеды("Велосипеды"),
    книгиИЖурналы("Книги и журналы"),
    коллекционирование("Коллекционирование"),
    музыкальныеИнструменты("Музыкальные инструменты"),
    охотаИРыбалка("Охота и рыбалка"),
    спортИОтдых("Спорт и отдых"),
    собаки("Собаки"),
    кошки("Кошки"),
    птицы("Птицы"),
    аквариум("Аквариум"),
    другиеЖивотные("Другие животные"),
    товарыДляЖивотных("Товары для животных"),
    готовыйБизнесИОборудование("ГОТОВЫЙ БИЗНЕС И ОБОРУДОВАНИЕ"),
    готовыйБизнес("Готовый бизнес"),
    оборудованиеДляБизнеса("Оборудование для бизнеса");

    private String value;

    Category(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }
}
